---
type: AdvancedWood
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 47
tags: [revit-api, class]
---

# AdvancedWood

`Autodesk.Revit.DB.Visual.AdvancedWood` · Revit 2024 · 47 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | WoodCurlyDistortionEnable | 2018.1 | `public static string WoodCurlyDistortionEnable { get ; }` |
| Property | WoodCurlyDistortionMap | 2018.1 | `public static string WoodCurlyDistortionMap { get ; }` |
| Property | WoodCurlyDistortionScale | 2018.1 | `public static string WoodCurlyDistortionScale { get ; }` |
| Property | WoodDiffuseLobeWeight | 2018.1 | `public static string WoodDiffuseLobeWeight { get ; }` |
| Property | WoodDiffusePerlinEnable | 2018.1 | `public static string WoodDiffusePerlinEnable { get ; }` |
| Property | WoodDiffusePerlinProf | 2018.1 | `public static string WoodDiffusePerlinProf { get ; }` |
| Property | WoodDiffusePerlinScaleZ | 2018.1 | `public static string WoodDiffusePerlinScaleZ { get ; }` |
| Property | WoodEarlyColor | 2018.1 | `public static string WoodEarlyColor { get ; }` |
| Property | WoodEarlycolorPerlinEnable | 2018.1 | `public static string WoodEarlycolorPerlinEnable { get ; }` |
| Property | WoodEarlycolorPerlinProf | 2018.1 | `public static string WoodEarlycolorPerlinProf { get ; }` |
| Property | WoodEarlywoodSharpness | 2018.1 | `public static string WoodEarlywoodSharpness { get ; }` |
| Property | WoodFiberCosineEnable | 2018.1 | `public static string WoodFiberCosineEnable { get ; }` |
| Property | WoodFiberCosineProf | 2018.1 | `public static string WoodFiberCosineProf { get ; }` |
| Property | WoodFiberPerlinEnable | 2018.1 | `public static string WoodFiberPerlinEnable { get ; }` |
| Property | WoodFiberPerlinProf | 2018.1 | `public static string WoodFiberPerlinProf { get ; }` |
| Property | WoodFiberPerlinScaleZ | 2018.1 | `public static string WoodFiberPerlinScaleZ { get ; }` |
| Property | WoodFiberRoughness | 2018.1 | `public static string WoodFiberRoughness { get ; }` |
| Property | WoodGrooveRoughness | 2018.1 | `public static string WoodGrooveRoughness { get ; }` |
| Property | WoodGrowthPerlinEnable | 2018.1 | `public static string WoodGrowthPerlinEnable { get ; }` |
| Property | WoodGrowthPerlinProf | 2018.1 | `public static string WoodGrowthPerlinProf { get ; }` |
| Property | WoodLateColorPower | 2018.1 | `public static string WoodLateColorPower { get ; }` |
| Property | WoodLatecolorPerlinEnable | 2018.1 | `public static string WoodLatecolorPerlinEnable { get ; }` |
| Property | WoodLatecolorPerlinProf | 2018.1 | `public static string WoodLatecolorPerlinProf { get ; }` |
| Property | WoodLatewoodBumpDepth | 2018.1 | `public static string WoodLatewoodBumpDepth { get ; }` |
| Property | WoodLatewoodRatio | 2018.1 | `public static string WoodLatewoodRatio { get ; }` |
| Property | WoodLatewoodSharpness | 2018.1 | `public static string WoodLatewoodSharpness { get ; }` |
| Property | WoodManualLateColor | 2018.1 | `public static string WoodManualLateColor { get ; }` |
| Property | WoodPoreCellDim | 2018.1 | `public static string WoodPoreCellDim { get ; }` |
| Property | WoodPoreColorPower | 2018.1 | `public static string WoodPoreColorPower { get ; }` |
| Property | WoodPoreDepth | 2018.1 | `public static string WoodPoreDepth { get ; }` |
| Property | WoodPoreRadius | 2018.1 | `public static string WoodPoreRadius { get ; }` |
| Property | WoodPoreType | 2018.1 | `public static string WoodPoreType { get ; }` |
| Property | WoodRayColorPower | 2018.1 | `public static string WoodRayColorPower { get ; }` |
| Property | WoodRayEllipseRadiusX | 2018.1 | `public static string WoodRayEllipseRadiusX { get ; }` |
| Property | WoodRayEllipseZ2x | 2018.1 | `public static string WoodRayEllipseZ2x { get ; }` |
| Property | WoodRayNumSlices | 2018.1 | `public static string WoodRayNumSlices { get ; }` |
| Property | WoodRaySegLengthZ | 2018.1 | `public static string WoodRaySegLengthZ { get ; }` |
| Property | WoodRingThickness | 2018.1 | `public static string WoodRingThickness { get ; }` |
| Property | WoodSecondaryColorPower | 2018.1 | `public static string WoodSecondaryColorPower { get ; }` |
| Property | WoodSecondaryPerlinEnable | 2018.1 | `public static string WoodSecondaryPerlinEnable { get ; }` |
| Property | WoodSecondaryPerlinProf | 2018.1 | `public static string WoodSecondaryPerlinProf { get ; }` |
| Property | WoodSecondaryPerlinScaleZ | 2018.1 | `public static string WoodSecondaryPerlinScaleZ { get ; }` |
| Property | WoodUseGrooveRoughness | 2018.1 | `public static string WoodUseGrooveRoughness { get ; }` |
| Property | WoodUseLatewoodBump | 2018.1 | `public static string WoodUseLatewoodBump { get ; }` |
| Property | WoodUseManualLateColor | 2018.1 | `public static string WoodUseManualLateColor { get ; }` |
| Property | WoodUsePores | 2018.1 | `public static string WoodUsePores { get ; }` |
| Property | WoodUseRays | 2018.1 | `public static string WoodUseRays { get ; }` |